#ifndef __CCL_INTERFACE_H__
#define __CCL_INTERFACE_H__
/**
 * Copyright (C), 2016-2020, Hytera Comm. Co., Ltd.
 * @file    ccl_interface.h
 * @brief   呼叫控制层接口应用函数
 * @author  牛功喜
 * @version v1.0
 * @date    2017-07-27
 */
/*
 *   函数列表
 *   修改历史
 *   2017-07-27                                牛功喜       建立文件
 *   *************************************************************************/

/******************************************************************************
 *   引用头文件声明
 *   *************************************************************************/
/******************************************************************************
 *   宏定义
 *   *************************************************************************/
 #define CT_DEVICE_POWER_DOWN         0x36                      ///<  系统下电
 #define CT_DEVICE_REBOOT_EPACK       0x37                      ///<  重启设备
 #define SIG_SMS_SEND                 0x000e                    // 短消息命令
 #define CC_SIG_HRD_LEN               28

/******************************************************************************
 *   类型定义
*   *************************************************************************/

/**
 * @struct _CENTER_CMD_SHAREHEADER
 * @brief  接入单元与中心命令交互共用头
 */
typedef struct  _CENTER_CMD_SHARE_HEAD
{
    unsigned short SigHead;         // 标识AC接口信令头标志(0x13ec)
    unsigned short SigType;         // 信令类型-标识AC接口PTT命令信令（0x000a）
    unsigned short Datalength;      // 有效数据长度-标识信令有效数据长度（100）
    unsigned short SourceID;        // 源单元号-标识AC接口发送单元ID值
    unsigned short DestID;          // 目的单元号-标识AC接口接收单元ID值
    unsigned char  SourceType;      // 源单元设备类型-标识发送单元设备类型（制式）
    unsigned char  SigVersion;      // 信令版本号-标识该信令适合版本号0x02(该信令与0x01版本不兼容)
    unsigned char  PathNum;         // 通道号码-标识该信令属于该单元的通道号码，若不区分通道，则填全F
    unsigned char  Exhead[11];      // 扩展头-扩展头中心无须关心参数
    unsigned int   CheckVal;        // 校验值-标识信令校验结果(01版本 与02版本 目前都填写全F，标示无校验方式)
} CENTER_CMD_SHARE_HEAD ;

/**
 * @struct SMS_CENTER_CCL_UL
 * @brief  中心发送短消息到CCL 接口
 */
typedef struct _SMS_CENTER_CCL_UL
{
    CENTER_CMD_SHARE_HEAD  SharedHead;
    unsigned int   CallId;          // 控制面ID 标识一次呼叫的控制面ID
    unsigned int   VoiceId;         // 业务面ID 标识一次呼叫的业务面ID
    unsigned char  SourceStat;      // 标识发送单元设备状态（空闲、故障、忙等）
    unsigned char  SmsType ;        // 短消息类型（组呼、个呼），增加组呼状态消息和个呼状态消息
    unsigned short ValidLength;     // 短消息有效长度（状态消息为2，短消息内容填2字节状态消息号码）
    unsigned char  SmsFormat  ;     // 短消息格式（ASCII=0x00、UNICODE=0x01等）
    unsigned char  SenderNum[30];   // 发送者号码
    unsigned char  ReceiverNum[30]; // 接收者号码
    unsigned char  SmsData[512];    // 短消息内容
    unsigned char  Reserved[3];
} SMS_CENTER_CCL_UL;


/******************************************************************************
 *   结构体定义
 *   *************************************************************************/



/******************************************************************************
 *   全局变量定义
 *   *************************************************************************/

/******************************************************************************
 *   局部变量定义
 *   *************************************************************************/

/******************************************************************************
 *   内部函数实现
 *   *************************************************************************/

/******************************************************************************
 *   可调用函数实现
 *   *************************************************************************/

/**
* @brief CCL 向CC 发送系统通知
*/
 void SentSysOptSig(unsigned char Type);

#endif //CCLUL_H



